
/**
	@file		mcu_types.h
	@brief		Интерфейсный файл определения машинозависимых типов данных
	@version	1
	@author		(C) ПАО НПО "Наука" 2019

 *******************************************************************************
<b> История изменений: </b>
@version 1		@date 07.07.16	@author DD
	\li Начальная версия
 ******************************************************************************/

#ifndef __mcu_types_h
#define __mcu_types_h

/*******************************************************************************
 * Defines
 ******************************************************************************/

/**
 * Вычисление количества элементов массива.
 *
 * @param[in]     a			массив
 *
 * @return количество элементов
 *
 */
#define countof(a)				( sizeof( a ) / sizeof( ( a )[0] ) )

/**
 * Игнорирование результата вызова функции.
 *
 * @param[in]     f			функция
 *
 */
#define result_ignore(f)		( (void)( f ) )

/*******************************************************************************
 * Structures
 ******************************************************************************/

/**
 * Булевое.
 */
typedef signed char boolean;

/**
 * Целое 8-битное знаковое.
 */
typedef signed char s8;

/**
 * Целое 8-битное беззнаковое.
 */
typedef unsigned char u8;

/**
 * Целое 16-битное знаковое.
 */
typedef signed short s16;

/**
 * Целое 16-битное беззнаковое.
 */
typedef unsigned short u16;

/**
 * Целое 32-битное знаковое.
 */
typedef signed long s32;

/**
 * Целое 32-битное беззнаковое.
 */
typedef unsigned long u32;

/**
 * Вещественное 32-битное.
 */
typedef float f32;

#endif	// __mcu_types_h
